results/factorial-final/security-overhead-final-tls-broker3/security-overhead-final-factorial-tls-b3-rf3-isr3-msg1024-tps1000-batch131072-acksall-prod6-complz4-trial1/producer-perf.log
run_id=security-overhead-final-factorial-tls-b3-rf3-isr3-msg1024-tps1000-batch131072-acksall-prod6-complz4-trial1
producer_count=6
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b3-rf3-isr3-msg1024-tps1000-batch131072-acksall-prod6-complz4-trial1/producer-perf-1.log -----
producer_index=1
producer_count=6
producer_records=16667
producer_throughput=167
1 records sent, 0.1 records/sec (0.00 MB/sec), 7205.0 ms avg latency, 7205.0 ms max latency.
2045 records sent, 408.3 records/sec (0.40 MB/sec), 806.7 ms avg latency, 1796.0 ms max latency.
837 records sent, 167.3 records/sec (0.16 MB/sec), 9.6 ms avg latency, 38.0 ms max latency.
836 records sent, 166.9 records/sec (0.16 MB/sec), 8.6 ms avg latency, 18.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 8.8 ms avg latency, 18.0 ms max latency.
837 records sent, 167.2 records/sec (0.16 MB/sec), 8.7 ms avg latency, 34.0 ms max latency.
837 records sent, 167.1 records/sec (0.16 MB/sec), 8.4 ms avg latency, 36.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 8.1 ms avg latency, 16.0 ms max latency.
837 records sent, 167.4 records/sec (0.16 MB/sec), 8.4 ms avg latency, 24.0 ms max latency.
837 records sent, 167.0 records/sec (0.16 MB/sec), 7.6 ms avg latency, 19.0 ms max latency.
837 records sent, 167.1 records/sec (0.16 MB/sec), 7.8 ms avg latency, 31.0 ms max latency.
837 records sent, 167.0 records/sec (0.16 MB/sec), 7.1 ms avg latency, 29.0 ms max latency.
836 records sent, 167.2 records/sec (0.16 MB/sec), 7.0 ms avg latency, 24.0 ms max latency.
836 records sent, 167.1 records/sec (0.16 MB/sec), 7.2 ms avg latency, 32.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 6.9 ms avg latency, 21.0 ms max latency.
836 records sent, 167.1 records/sec (0.16 MB/sec), 6.8 ms avg latency, 9.0 ms max latency.
835 records sent, 166.8 records/sec (0.16 MB/sec), 6.9 ms avg latency, 19.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 6.9 ms avg latency, 14.0 ms max latency.
836 records sent, 167.1 records/sec (0.16 MB/sec), 6.9 ms avg latency, 22.0 ms max latency.
16667 records sent, 166.942116 records/sec (0.16 MB/sec), 106.19 ms avg latency, 7205.00 ms max latency, 7 ms 50th, 1221 ms 95th, 1630 ms 99th, 1701 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b3-rf3-isr3-msg1024-tps1000-batch131072-acksall-prod6-complz4-trial1/producer-perf-2.log -----
producer_index=2
producer_count=6
producer_records=16667
producer_throughput=167
1 records sent, 0.1 records/sec (0.00 MB/sec), 7215.0 ms avg latency, 7215.0 ms max latency.
2043 records sent, 408.5 records/sec (0.40 MB/sec), 726.2 ms avg latency, 1692.0 ms max latency.
839 records sent, 167.5 records/sec (0.16 MB/sec), 9.3 ms avg latency, 30.0 ms max latency.
837 records sent, 167.1 records/sec (0.16 MB/sec), 8.4 ms avg latency, 19.0 ms max latency.
837 records sent, 167.0 records/sec (0.16 MB/sec), 8.6 ms avg latency, 25.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 8.4 ms avg latency, 37.0 ms max latency.
837 records sent, 167.3 records/sec (0.16 MB/sec), 8.2 ms avg latency, 32.0 ms max latency.
836 records sent, 166.9 records/sec (0.16 MB/sec), 8.1 ms avg latency, 20.0 ms max latency.
837 records sent, 167.4 records/sec (0.16 MB/sec), 8.4 ms avg latency, 24.0 ms max latency.
836 records sent, 166.9 records/sec (0.16 MB/sec), 7.6 ms avg latency, 19.0 ms max latency.
837 records sent, 167.2 records/sec (0.16 MB/sec), 7.8 ms avg latency, 30.0 ms max latency.
836 records sent, 167.2 records/sec (0.16 MB/sec), 7.3 ms avg latency, 24.0 ms max latency.
835 records sent, 166.9 records/sec (0.16 MB/sec), 7.2 ms avg latency, 29.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 7.2 ms avg latency, 30.0 ms max latency.
836 records sent, 167.1 records/sec (0.16 MB/sec), 7.0 ms avg latency, 25.0 ms max latency.
836 records sent, 167.1 records/sec (0.16 MB/sec), 6.8 ms avg latency, 11.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 6.9 ms avg latency, 19.0 ms max latency.
835 records sent, 166.9 records/sec (0.16 MB/sec), 6.8 ms avg latency, 11.0 ms max latency.
837 records sent, 167.2 records/sec (0.16 MB/sec), 6.9 ms avg latency, 27.0 ms max latency.
16667 records sent, 166.938771 records/sec (0.16 MB/sec), 96.19 ms avg latency, 7215.00 ms max latency, 7 ms 50th, 1244 ms 95th, 1450 ms 99th, 1534 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b3-rf3-isr3-msg1024-tps1000-batch131072-acksall-prod6-complz4-trial1/producer-perf-3.log -----
producer_index=3
producer_count=6
producer_records=16667
producer_throughput=167
1 records sent, 0.1 records/sec (0.00 MB/sec), 7414.0 ms avg latency, 7414.0 ms max latency.
2076 records sent, 414.9 records/sec (0.41 MB/sec), 966.2 ms avg latency, 1831.0 ms max latency.
838 records sent, 167.2 records/sec (0.16 MB/sec), 9.4 ms avg latency, 25.0 ms max latency.
837 records sent, 167.1 records/sec (0.16 MB/sec), 8.7 ms avg latency, 32.0 ms max latency.
835 records sent, 166.9 records/sec (0.16 MB/sec), 8.5 ms avg latency, 23.0 ms max latency.
837 records sent, 167.2 records/sec (0.16 MB/sec), 8.6 ms avg latency, 36.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 8.6 ms avg latency, 30.0 ms max latency.
836 records sent, 167.1 records/sec (0.16 MB/sec), 8.2 ms avg latency, 18.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 8.5 ms avg latency, 23.0 ms max latency.
836 records sent, 167.2 records/sec (0.16 MB/sec), 7.8 ms avg latency, 17.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 7.7 ms avg latency, 27.0 ms max latency.
838 records sent, 167.2 records/sec (0.16 MB/sec), 7.2 ms avg latency, 24.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 7.1 ms avg latency, 29.0 ms max latency.
836 records sent, 167.1 records/sec (0.16 MB/sec), 7.3 ms avg latency, 31.0 ms max latency.
835 records sent, 167.0 records/sec (0.16 MB/sec), 7.0 ms avg latency, 24.0 ms max latency.
836 records sent, 167.1 records/sec (0.16 MB/sec), 6.8 ms avg latency, 11.0 ms max latency.
835 records sent, 167.0 records/sec (0.16 MB/sec), 6.9 ms avg latency, 20.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 6.9 ms avg latency, 12.0 ms max latency.
837 records sent, 167.2 records/sec (0.16 MB/sec), 6.8 ms avg latency, 26.0 ms max latency.
16667 records sent, 166.928740 records/sec (0.16 MB/sec), 127.58 ms avg latency, 7414.00 ms max latency, 7 ms 50th, 1606 ms 95th, 1745 ms 99th, 1811 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b3-rf3-isr3-msg1024-tps1000-batch131072-acksall-prod6-complz4-trial1/producer-perf-4.log -----
producer_index=4
producer_count=6
producer_records=16667
producer_throughput=167
1 records sent, 0.1 records/sec (0.00 MB/sec), 7549.0 ms avg latency, 7549.0 ms max latency.
2100 records sent, 419.7 records/sec (0.41 MB/sec), 737.4 ms avg latency, 1530.0 ms max latency.
834 records sent, 166.5 records/sec (0.16 MB/sec), 9.0 ms avg latency, 32.0 ms max latency.
840 records sent, 167.8 records/sec (0.16 MB/sec), 8.5 ms avg latency, 33.0 ms max latency.
835 records sent, 166.9 records/sec (0.16 MB/sec), 8.6 ms avg latency, 26.0 ms max latency.
836 records sent, 167.2 records/sec (0.16 MB/sec), 8.6 ms avg latency, 34.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 8.6 ms avg latency, 30.0 ms max latency.
836 records sent, 167.1 records/sec (0.16 MB/sec), 8.0 ms avg latency, 19.0 ms max latency.
835 records sent, 167.0 records/sec (0.16 MB/sec), 8.6 ms avg latency, 33.0 ms max latency.
836 records sent, 167.1 records/sec (0.16 MB/sec), 7.5 ms avg latency, 15.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 8.0 ms avg latency, 27.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 7.0 ms avg latency, 24.0 ms max latency.
836 records sent, 167.2 records/sec (0.16 MB/sec), 7.3 ms avg latency, 29.0 ms max latency.
836 records sent, 167.1 records/sec (0.16 MB/sec), 7.1 ms avg latency, 31.0 ms max latency.
835 records sent, 167.0 records/sec (0.16 MB/sec), 7.0 ms avg latency, 25.0 ms max latency.
836 records sent, 167.1 records/sec (0.16 MB/sec), 6.8 ms avg latency, 11.0 ms max latency.
836 records sent, 167.1 records/sec (0.16 MB/sec), 7.0 ms avg latency, 20.0 ms max latency.
835 records sent, 166.9 records/sec (0.16 MB/sec), 6.8 ms avg latency, 13.0 ms max latency.
835 records sent, 167.0 records/sec (0.16 MB/sec), 7.0 ms avg latency, 27.0 ms max latency.
16667 records sent, 166.933755 records/sec (0.16 MB/sec), 100.10 ms avg latency, 7549.00 ms max latency, 7 ms 50th, 1136 ms 95th, 1483 ms 99th, 1515 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b3-rf3-isr3-msg1024-tps1000-batch131072-acksall-prod6-complz4-trial1/producer-perf-5.log -----
producer_index=5
producer_count=6
producer_records=16666
producer_throughput=166
1 records sent, 0.1 records/sec (0.00 MB/sec), 7059.0 ms avg latency, 7059.0 ms max latency.
2008 records sent, 401.0 records/sec (0.39 MB/sec), 970.4 ms avg latency, 1883.0 ms max latency.
833 records sent, 166.2 records/sec (0.16 MB/sec), 9.7 ms avg latency, 25.0 ms max latency.
832 records sent, 166.0 records/sec (0.16 MB/sec), 9.2 ms avg latency, 25.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 9.2 ms avg latency, 31.0 ms max latency.
831 records sent, 166.2 records/sec (0.16 MB/sec), 9.1 ms avg latency, 38.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 8.7 ms avg latency, 31.0 ms max latency.
830 records sent, 165.9 records/sec (0.16 MB/sec), 8.4 ms avg latency, 20.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 8.7 ms avg latency, 27.0 ms max latency.
832 records sent, 166.3 records/sec (0.16 MB/sec), 8.0 ms avg latency, 17.0 ms max latency.
832 records sent, 166.2 records/sec (0.16 MB/sec), 8.0 ms avg latency, 25.0 ms max latency.
830 records sent, 166.0 records/sec (0.16 MB/sec), 7.2 ms avg latency, 23.0 ms max latency.
831 records sent, 166.2 records/sec (0.16 MB/sec), 7.2 ms avg latency, 28.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 7.3 ms avg latency, 28.0 ms max latency.
830 records sent, 165.9 records/sec (0.16 MB/sec), 6.9 ms avg latency, 20.0 ms max latency.
832 records sent, 166.4 records/sec (0.16 MB/sec), 6.8 ms avg latency, 14.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 6.9 ms avg latency, 18.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 7.0 ms avg latency, 15.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 6.8 ms avg latency, 25.0 ms max latency.
16666 records sent, 165.959650 records/sec (0.16 MB/sec), 124.29 ms avg latency, 7059.00 ms max latency, 8 ms 50th, 1519 ms 95th, 1824 ms 99th, 1853 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b3-rf3-isr3-msg1024-tps1000-batch131072-acksall-prod6-complz4-trial1/producer-perf-6.log -----
producer_index=6
producer_count=6
producer_records=16666
producer_throughput=166
1 records sent, 0.1 records/sec (0.00 MB/sec), 7229.0 ms avg latency, 7229.0 ms max latency.
2036 records sent, 406.5 records/sec (0.40 MB/sec), 761.0 ms avg latency, 1493.0 ms max latency.
832 records sent, 166.2 records/sec (0.16 MB/sec), 9.8 ms avg latency, 38.0 ms max latency.
831 records sent, 166.2 records/sec (0.16 MB/sec), 9.2 ms avg latency, 22.0 ms max latency.
832 records sent, 166.2 records/sec (0.16 MB/sec), 9.3 ms avg latency, 24.0 ms max latency.
832 records sent, 166.0 records/sec (0.16 MB/sec), 9.1 ms avg latency, 35.0 ms max latency.
830 records sent, 165.9 records/sec (0.16 MB/sec), 8.9 ms avg latency, 32.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 8.7 ms avg latency, 30.0 ms max latency.
829 records sent, 165.8 records/sec (0.16 MB/sec), 8.9 ms avg latency, 22.0 ms max latency.
833 records sent, 166.4 records/sec (0.16 MB/sec), 8.4 ms avg latency, 19.0 ms max latency.
831 records sent, 166.2 records/sec (0.16 MB/sec), 8.0 ms avg latency, 29.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 7.6 ms avg latency, 28.0 ms max latency.
831 records sent, 166.2 records/sec (0.16 MB/sec), 7.3 ms avg latency, 26.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 7.2 ms avg latency, 23.0 ms max latency.
830 records sent, 165.9 records/sec (0.16 MB/sec), 6.9 ms avg latency, 24.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 6.9 ms avg latency, 12.0 ms max latency.
831 records sent, 166.2 records/sec (0.16 MB/sec), 6.9 ms avg latency, 20.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 6.8 ms avg latency, 13.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 6.9 ms avg latency, 24.0 ms max latency.
16666 records sent, 165.939821 records/sec (0.16 MB/sec), 100.43 ms avg latency, 7229.00 ms max latency, 8 ms 50th, 1188 ms 95th, 1416 ms 99th, 1482 ms 99.9th.